//Опис: Ви отримали рядок, який містить ім’я та прізвище користувача. Ваша мета - перевірити, чи починається прізвище на ту ж літеру, що й ім’я. Якщо так, вивести повідомлення “Прізвище починається на ту ж літеру, що і ім’я”, інакше - “Прізвище не починається на ту ж літеру, що і ім’я”.
//Ви розробляєте програму для генерації текстового звіту. Ваше завдання - створити текстовий звіт, який містить заголовок, дату та список подій. Використайте StringBuilder, щоб зберегти пам’ять та оптимізувати об’єднання рядків. Користувач у циклi буде вводити подiї, треба додавати їх у загальний список подiй типу StringBuilder .
//Опис: Ви отримали рядок, який містить декілька слів, розділених комами. Ваша мета - видалити всі пробіли з цього рядка та вивести результат.

// 1.Ви отримали рядок, який містить ім’я та прізвище користувача. Ваша мета - перевірити, чи починається прізвище на ту ж літеру, що й ім’я. Якщо так, вивести повідомлення “Прізвище починається на ту ж літеру, що і ім’я”, інакше - “Прізвище не починається на ту ж літеру, що і ім’я”.

//string str = "name Nurname";
//string lowerStr = str.ToLower();
//string[] words = lowerStr.Split(" ");
//char nameFirstLetter = words[0][0];
//char surnameFirstLetter = words[1][0];

//if (nameFirstLetter == surnameFirstLetter)
//{
//    Console.WriteLine("Прізвище починається на ту ж літеру, що і ім’я");
//} else
//{
//    Console.WriteLine("Прізвище не починається на ту ж літеру, що і ім’я");
//}

// 2. Ви розробляєте програму для генерації текстового звіту. Ваше завдання - створити текстовий звіт, який містить заголовок, дату та список подій. Використайте StringBuilder, щоб зберегти пам’ять та оптимізувати об’єднання рядків. Користувач у циклi буде вводити подiї, треба додавати їх у загальний список подiй типу StringBuilder.

using System.Text;

StringBuilder report = new StringBuilder();
string[] fields = ["title", "date", "description"];

for (int i = 0; i < fields.Length; i++)
{
    Console.WriteLine($"Enter {fields[i]}:");
    report.AppendLine($"{fields[i]}: {Console.ReadLine()}");
}

Console.WriteLine(report);

// 3. Ви отримали рядок, який містить декілька слів, розділених комами. Ваша мета - видалити всі пробіли з цього рядка та вивести результат.

//string str = "word1, word2, word3";
//Console.WriteLine(str.Replace(" ", ""));
